wfmarques/nrf52-ble-custom-service-sdk14/main.c
static void gpio_pin_low(int pin) {
    nrf_drv_gpiote_out_clear(pin);    
    nrf_drv_gpiote_out_toggle(pin);     
}

static void gpio_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);
        
    nrf_drv_gpiote_out_config_t out_config = GPIOTE_CONFIG_OUT_SIMPLE(false);

    err_code = nrf_drv_gpiote_out_init(BSP_LED_1, &out_config);
    APP_ERROR_CHECK(err_code);
    
    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(false);
    in_config.pull = NRF_GPIO_PIN_PULLUP;

    err_code = nrf_drv_gpiote_in_init(PIN_IN, &in_config, in_pin_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(PIN_IN, true);

}


/**  MY CUSTOM FUNCTIONS **/
void update_data()
{
    //Send back some data
    for(int i=1;i<CHARACTERISTIC_SIZE;i++){
        char2_data[i] = 0;
    }
    char2_data[0] = maxCounter;
    //char2_data[1] = timeCounter;
    ret_code_t err_code = mycustom_service_update_data(m_conn_handle,char2_data);
    APP_ERROR_CHECK(err_code);
   
}  

void timer_signal_handler(void* p_context)
{ 
    update_data();

    timeCounter++;  
    SEGGER_RTT_printf(0, "TIMER %d\n", timeCounter); 

    if (timeCounter%2 == 0) {
        gpio_pin_high(PIN_OUT_1);
    } else {
        gpio_pin_low(PIN_OUT_1);
    }

    if (timeCounter >= maxCounter) {
        application_timers_stop();
        gpio_pin_low(PIN_OUT_1);
    }

    
}

  

static void on_ble_evt(ble_evt_t * p_ble_evt)
{
   
    uint8_t i=0;
    switch (p_ble_evt->header.evt_id)
            {

        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_DEBUG("BLE_GAP_EVT_CONNECTED");
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            break;
        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_DEBUG("BLE_GAP_EVT_DISCONNECTED");
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;
        case BLE_GAP_EVT_TIMEOUT:
            NRF_LOG_DEBUG("BLE_GAP_EVT_TIMEOUT");
        case BLE_GATTS_EVT_WRITE:
            NRF_LOG_DEBUG("BLE_GATTS_EVT_WRITE");
            for(i=0;i<p_ble_evt->evt.gatts_evt.params.write.len;i++) 
            {   
                uint8_t signal = p_ble_evt->evt.gatts_evt.params.write.data[i];
                NRF_LOG_DEBUG("Data Receipt %d: 0x%x", i, signal);
                maxCounter = signal;
                timeCounter = 0;
                application_timers_start(); 
            } 
        default:
            // No implementation needed.
            break;
       }     
}

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            SEGGER_RTT_printf(0,"\nConnected to a previously bonded device.\r\n");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            SEGGER_RTT_printf(0,"\nConnection secured: role: %d, conn_handle: 0x%x, procedure: %d.\r\n",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            SEGGER_RTT_printf(0,"\nPM_EVT_CONN_SEC_FAILED");
    
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {   
            SEGGER_RTT_printf(0,"\nPM_EVT_CONN_SEC_CONFIG_REQ");
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                SEGGER_RTT_printf(0,"\nPM_EVT_STORAGE_FULL GC FAILED");
            } else {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {   
            SEGGER_RTT_printf(0,"\nPM_EVT_PEERS_DELETE_SUCCEEDED");
            advertising_start(false);
        } break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        {
            // The local database has likely changed, send service changed indications.
            SEGGER_RTT_printf(0,"\nPM_EVT_LOCAL_DB_CACHE_APPLY_FAILED");
            pm_local_database_has_changed();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            SEGGER_RTT_printf(0,"\nPM_EVT_PEER_DATA_UPDATE_FAILED");
            APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            SEGGER_RTT_printf(0,"\nPM_EVT_PEER_DELETE_FAILED");
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            SEGGER_RTT_printf(0,"\nPM_EVT_PEERS_DELETE_FAILED");
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}



/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);  
    // Create timers.
    err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_signal_handler);
    APP_ERROR_CHECK(err_code); 

    // err_code = app_timer_create(&m_app_timer_id2, APP_TIMER_MODE_REPEATED, timer_update_data_handler);
    // APP_ERROR_CHECK(err_code); 
}


