wfmarques/nrf52-ble-custom-service-sdk14/main.c
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    uint32_t err_code;

    // Initialize.
    log_init();

    SEGGER_RTT_printf(0, "\n");
    SEGGER_RTT_printf(0,"=======================\n");
    SEGGER_RTT_printf(0,"======My Custom BLE Device====\n");
    SEGGER_RTT_printf(0,DEVICE_NAME);
    SEGGER_RTT_printf(0, "\n");
    SEGGER_RTT_printf(0,"=======================\n");

    SEGGER_RTT_printf(0,"->timers_init().\n");
    timers_init();
    SEGGER_RTT_printf(0,"->ble_stack_init().\n");
    ble_stack_init();
    SEGGER_RTT_printf(0,"->gap_params_init().\n");
    gap_params_init();
    SEGGER_RTT_printf(0,"->gatt_init().\n");
    gatt_init();
    SEGGER_RTT_printf(0,"->advertising_init().\n");
    advertising_init();
    SEGGER_RTT_printf(0,"->services_init().\n");
    services_init();
    SEGGER_RTT_printf(0,"->conn_params_init().\n");
    conn_params_init();
    SEGGER_RTT_printf(0,"->peer_manager_init().\n");
    peer_manager_init();
    SEGGER_RTT_printf(0,"->gpio_init().\n");
    gpio_init();
    
    // Start execution.
  
   
    advertising_start(erase_bonds);
 
    SEGGER_RTT_printf(0,"\n");
    SEGGER_RTT_printf(0,"=======================\n");
    SEGGER_RTT_printf(0,"===My Custom BLE Device initialized==\n");
    SEGGER_RTT_printf(0,"=======================\n");  

     // Enter main loop.
    for (;;)
    {   
        power_manage();
      
    }
}


/**
 * @}
 */